Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
09:43:44.648 INFO   Downloading Terraform configurations from file:///home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default into /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default/.terragrunt-cache/taPxevW1G1I3JmXFhpbQyVNigOM/Mlplaatj-ONNhxKylvscs9fzDIU
09:43:44.920 STDOUT terraform: Initializing the backend...
09:43:45.012 STDOUT terraform: Successfully configured the backend "s3"! Terraform will automatically
09:43:45.012 STDOUT terraform: use this backend unless the backend configuration changes.
09:43:45.076 STDOUT terraform: Initializing provider plugins...
09:43:45.076 STDOUT terraform: - Reusing previous version of hashicorp/random from the dependency lock file
09:43:45.096 STDOUT terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
09:43:45.156 STDOUT terraform: - Using hashicorp/random v3.6.3 from the shared cache directory
09:43:47.492 STDOUT terraform: - Using hashicorp/aws v5.69.0 from the shared cache directory
09:43:52.042 STDOUT terraform: Terraform has been successfully initialized!
09:43:52.042 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
09:43:52.042 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
09:43:52.042 STDOUT terraform: should now work.
09:43:52.042 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
09:43:52.042 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
09:43:52.042 STDOUT terraform: commands will detect it and remind you to do so if necessary.
09:43:57.977 STDOUT terraform: random_pet.bucket_name: Refreshing state... [id=gladly-friendly-officially-precise-ferret]
09:43:58.525 STDOUT terraform: Terraform used the selected providers to generate the following execution
09:43:58.525 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
09:43:58.525 STDOUT terraform:   + create
09:43:58.525 STDOUT terraform: -/+ destroy and then create replacement
09:43:58.525 STDOUT terraform: Terraform will perform the following actions:
09:43:58.526 STDOUT terraform:   # aws_s3_bucket.test_bucket will be created
09:43:58.526 STDOUT terraform:   + resource "aws_s3_bucket" "test_bucket" {
09:43:58.526 STDOUT terraform:       + acceleration_status         = (known after apply)
09:43:58.526 STDOUT terraform:       + acl                         = (known after apply)
09:43:58.526 STDOUT terraform:       + arn                         = (known after apply)
09:43:58.526 STDOUT terraform:       + bucket                      = (known after apply)
09:43:58.526 STDOUT terraform:       + bucket_domain_name          = (known after apply)
09:43:58.526 STDOUT terraform:       + bucket_prefix               = (known after apply)
09:43:58.526 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
09:43:58.526 STDOUT terraform:       + force_destroy               = false
09:43:58.526 STDOUT terraform:       + hosted_zone_id              = (known after apply)
09:43:58.526 STDOUT terraform:       + id                          = (known after apply)
09:43:58.526 STDOUT terraform:       + object_lock_enabled         = (known after apply)
09:43:58.526 STDOUT terraform:       + policy                      = (known after apply)
09:43:58.526 STDOUT terraform:       + region                      = (known after apply)
09:43:58.526 STDOUT terraform:       + request_payer               = (known after apply)
09:43:58.526 STDOUT terraform:       + tags_all                    = (known after apply)
09:43:58.526 STDOUT terraform:       + website_domain              = (known after apply)
09:43:58.526 STDOUT terraform:       + website_endpoint            = (known after apply)
09:43:58.526 STDOUT terraform:       + cors_rule (known after apply)
09:43:58.526 STDOUT terraform:       + grant (known after apply)
09:43:58.526 STDOUT terraform:       + lifecycle_rule (known after apply)
09:43:58.526 STDOUT terraform:       + logging (known after apply)
09:43:58.526 STDOUT terraform:       + object_lock_configuration (known after apply)
09:43:58.526 STDOUT terraform:       + replication_configuration (known after apply)
09:43:58.526 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
09:43:58.526 STDOUT terraform:       + versioning (known after apply)
09:43:58.526 STDOUT terraform:       + website (known after apply)
09:43:58.526 STDOUT terraform:     }
09:43:58.526 STDOUT terraform:   # random_pet.bucket_name must be replaced
09:43:58.526 STDOUT terraform: -/+ resource "random_pet" "bucket_name" {
09:43:58.526 STDOUT terraform:       ~ id        = "gladly-friendly-officially-precise-ferret" -> (known after apply)
09:43:58.526 STDOUT terraform:       ~ length    = 5 -> 2 # forces replacement
09:43:58.526 STDOUT terraform:         # (1 unchanged attribute hidden)
09:43:58.526 STDOUT terraform:     }
09:43:58.526 STDOUT terraform: Plan: 2 to add, 0 to change, 1 to destroy.
09:43:58.526 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
09:43:58.526 STDOUT terraform: Saved the plan to:
09:43:58.526 STDOUT terraform: /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default/default.tfplan
09:43:58.526 STDOUT terraform: To perform exactly these actions, run the following command to apply:
09:43:58.526 STDOUT terraform:     terraform apply "/home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default/default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://54.151.149.180:4141/lock?id=amitkarpe%252Fatlantis-test%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```